results/ai-agent-continuous/logs/cpu-spike-logs/k6-cpu-spike-run1.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 40 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 04/40 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 04/40 VUs  0m01.0s/1m00.0s

running (0m02.0s), 08/40 VUs, 5 complete and 0 interrupted iterations
default   [   3% ] 08/40 VUs  0m02.0s/1m00.0s

running (0m03.0s), 12/40 VUs, 15 complete and 0 interrupted iterations
default   [   5% ] 12/40 VUs  0m03.0s/1m00.0s

running (0m04.0s), 16/40 VUs, 31 complete and 0 interrupted iterations
default   [   7% ] 16/40 VUs  0m04.0s/1m00.0s

running (0m05.0s), 20/40 VUs, 57 complete and 0 interrupted iterations
default   [   8% ] 20/40 VUs  0m05.0s/1m00.0s

running (0m06.0s), 24/40 VUs, 83 complete and 0 interrupted iterations
default   [  10% ] 24/40 VUs  0m06.0s/1m00.0s

running (0m07.0s), 28/40 VUs, 117 complete and 0 interrupted iterations
default   [  12% ] 28/40 VUs  0m07.0s/1m00.0s

running (0m08.0s), 32/40 VUs, 156 complete and 0 interrupted iterations
default   [  13% ] 32/40 VUs  0m08.0s/1m00.0s

running (0m09.0s), 36/40 VUs, 197 complete and 0 interrupted iterations
default   [  15% ] 36/40 VUs  0m09.0s/1m00.0s

running (0m10.0s), 39/40 VUs, 244 complete and 0 interrupted iterations
default   [  17% ] 39/40 VUs  0m10.0s/1m00.0s

running (0m11.0s), 40/40 VUs, 290 complete and 0 interrupted iterations
default   [  18% ] 40/40 VUs  0m11.0s/1m00.0s

running (0m12.0s), 40/40 VUs, 341 complete and 0 interrupted iterations
default   [  20% ] 40/40 VUs  0m12.0s/1m00.0s

running (0m13.0s), 40/40 VUs, 390 complete and 0 interrupted iterations
default   [  22% ] 40/40 VUs  0m13.0s/1m00.0s

running (0m14.0s), 40/40 VUs, 439 complete and 0 interrupted iterations
default   [  23% ] 40/40 VUs  0m14.0s/1m00.0s

running (0m15.0s), 40/40 VUs, 491 complete and 0 interrupted iterations
default   [  25% ] 40/40 VUs  0m15.0s/1m00.0s

running (0m16.0s), 40/40 VUs, 542 complete and 0 interrupted iterations
default   [  27% ] 40/40 VUs  0m16.0s/1m00.0s

running (0m17.0s), 40/40 VUs, 590 complete and 0 interrupted iterations
default   [  28% ] 40/40 VUs  0m17.0s/1m00.0s

running (0m18.0s), 40/40 VUs, 637 complete and 0 interrupted iterations
default   [  30% ] 40/40 VUs  0m18.0s/1m00.0s

running (0m19.0s), 40/40 VUs, 688 complete and 0 interrupted iterations
default   [  32% ] 40/40 VUs  0m19.0s/1m00.0s

running (0m20.0s), 40/40 VUs, 731 complete and 0 interrupted iterations
default   [  33% ] 40/40 VUs  0m20.0s/1m00.0s

running (0m21.0s), 40/40 VUs, 778 complete and 0 interrupted iterations
default   [  35% ] 40/40 VUs  0m21.0s/1m00.0s

running (0m22.0s), 40/40 VUs, 833 complete and 0 interrupted iterations
default   [  37% ] 40/40 VUs  0m22.0s/1m00.0s

running (0m23.0s), 40/40 VUs, 888 complete and 0 interrupted iterations
default   [  38% ] 40/40 VUs  0m23.0s/1m00.0s

running (0m24.0s), 40/40 VUs, 931 complete and 0 interrupted iterations
default   [  40% ] 40/40 VUs  0m24.0s/1m00.0s

running (0m25.0s), 40/40 VUs, 982 complete and 0 interrupted iterations
default   [  42% ] 40/40 VUs  0m25.0s/1m00.0s

running (0m26.0s), 40/40 VUs, 1039 complete and 0 interrupted iterations
default   [  43% ] 40/40 VUs  0m26.0s/1m00.0s

running (0m27.0s), 40/40 VUs, 1082 complete and 0 interrupted iterations
default   [  45% ] 40/40 VUs  0m27.0s/1m00.0s

running (0m28.0s), 40/40 VUs, 1133 complete and 0 interrupted iterations
default   [  47% ] 40/40 VUs  0m28.0s/1m00.0s

running (0m29.0s), 40/40 VUs, 1177 complete and 0 interrupted iterations
default   [  48% ] 40/40 VUs  0m29.0s/1m00.0s

running (0m30.0s), 40/40 VUs, 1223 complete and 0 interrupted iterations
default   [  50% ] 40/40 VUs  0m30.0s/1m00.0s

running (0m31.0s), 40/40 VUs, 1264 complete and 0 interrupted iterations
default   [  52% ] 40/40 VUs  0m31.0s/1m00.0s

running (0m32.0s), 40/40 VUs, 1315 complete and 0 interrupted iterations
default   [  53% ] 40/40 VUs  0m32.0s/1m00.0s

running (0m33.0s), 40/40 VUs, 1370 complete and 0 interrupted iterations
default   [  55% ] 40/40 VUs  0m33.0s/1m00.0s

running (0m34.0s), 40/40 VUs, 1415 complete and 0 interrupted iterations
default   [  57% ] 40/40 VUs  0m34.0s/1m00.0s

running (0m35.0s), 40/40 VUs, 1462 complete and 0 interrupted iterations
default   [  58% ] 40/40 VUs  0m35.0s/1m00.0s

running (0m36.0s), 40/40 VUs, 1512 complete and 0 interrupted iterations
default   [  60% ] 40/40 VUs  0m36.0s/1m00.0s

running (0m37.0s), 40/40 VUs, 1563 complete and 0 interrupted iterations
default   [  62% ] 40/40 VUs  0m37.0s/1m00.0s

running (0m38.0s), 40/40 VUs, 1616 complete and 0 interrupted iterations
default   [  63% ] 40/40 VUs  0m38.0s/1m00.0s

running (0m39.0s), 40/40 VUs, 1660 complete and 0 interrupted iterations
default   [  65% ] 40/40 VUs  0m39.0s/1m00.0s

running (0m40.0s), 40/40 VUs, 1713 complete and 0 interrupted iterations
default   [  67% ] 40/40 VUs  0m40.0s/1m00.0s

running (0m41.0s), 40/40 VUs, 1770 complete and 0 interrupted iterations
default   [  68% ] 40/40 VUs  0m41.0s/1m00.0s

running (0m42.0s), 40/40 VUs, 1820 complete and 0 interrupted iterations
default   [  70% ] 40/40 VUs  0m42.0s/1m00.0s

running (0m43.0s), 40/40 VUs, 1864 complete and 0 interrupted iterations
default   [  72% ] 40/40 VUs  0m43.0s/1m00.0s

running (0m44.0s), 40/40 VUs, 1916 complete and 0 interrupted iterations
default   [  73% ] 40/40 VUs  0m44.0s/1m00.0s

running (0m45.0s), 40/40 VUs, 1964 complete and 0 interrupted iterations
default   [  75% ] 40/40 VUs  0m45.0s/1m00.0s

running (0m46.0s), 40/40 VUs, 2018 complete and 0 interrupted iterations
default   [  77% ] 40/40 VUs  0m46.0s/1m00.0s

running (0m47.0s), 40/40 VUs, 2069 complete and 0 interrupted iterations
default   [  78% ] 40/40 VUs  0m47.0s/1m00.0s

running (0m48.0s), 40/40 VUs, 2124 complete and 0 interrupted iterations
default   [  80% ] 40/40 VUs  0m48.0s/1m00.0s

running (0m49.0s), 40/40 VUs, 2164 complete and 0 interrupted iterations
default   [  82% ] 40/40 VUs  0m49.0s/1m00.0s

running (0m50.0s), 40/40 VUs, 2219 complete and 0 interrupted iterations
default   [  83% ] 40/40 VUs  0m50.0s/1m00.0s

running (0m51.0s), 39/40 VUs, 2271 complete and 0 interrupted iterations
default   [  85% ] 39/40 VUs  0m51.0s/1m00.0s

running (0m52.0s), 35/40 VUs, 2319 complete and 0 interrupted iterations
default   [  87% ] 35/40 VUs  0m52.0s/1m00.0s

running (0m53.0s), 31/40 VUs, 2362 complete and 0 interrupted iterations
default   [  88% ] 31/40 VUs  0m53.0s/1m00.0s

running (0m54.0s), 26/40 VUs, 2407 complete and 0 interrupted iterations
default   [  90% ] 26/40 VUs  0m54.0s/1m00.0s

running (0m55.0s), 22/40 VUs, 2442 complete and 0 interrupted iterations
default   [  92% ] 22/40 VUs  0m55.0s/1m00.0s

running (0m56.0s), 17/40 VUs, 2473 complete and 0 interrupted iterations
default   [  93% ] 17/40 VUs  0m56.0s/1m00.0s

running (0m57.0s), 15/40 VUs, 2499 complete and 0 interrupted iterations
default   [  95% ] 15/40 VUs  0m57.0s/1m00.0s

running (0m58.0s), 11/40 VUs, 2518 complete and 0 interrupted iterations
default   [  97% ] 11/40 VUs  0m58.0s/1m00.0s

running (0m59.0s), 06/40 VUs, 2534 complete and 0 interrupted iterations
default   [  98% ] 06/40 VUs  0m59.0s/1m00.0s

running (1m00.0s), 02/40 VUs, 2541 complete and 0 interrupted iterations
default   [ 100% ] 02/40 VUs  1m00.0s/1m00.0s


  █ TOTAL RESULTS 

    checks_total.......: 7629   126.807012/s
    checks_succeeded...: 66.66% 5086 out of 7629
    checks_failed......: 33.33% 2543 out of 7629

    ✓ Homepage loaded
    ✓ Added to cart
    ✗ Checkout successful
      ↳  0% — ✓ 0 / ✗ 2543

    HTTP
    http_req_duration..............: avg=185.33ms min=143.35ms med=180.02ms max=1.06s p(90)=222.07ms p(95)=234.1ms 
      { expected_response:true }...: avg=187.14ms min=143.35ms med=179.23ms max=1.06s p(90)=226.94ms p(95)=239.48ms
    http_req_failed................: 25.00% 2543 out of 10172
    http_reqs......................: 10172  169.076016/s

    EXECUTION
    iteration_duration.............: avg=794.39ms min=653.61ms med=798.34ms max=1.88s p(90)=869.75ms p(95)=900.14ms
    iterations.....................: 2543   42.269004/s
    vus............................: 2      min=2             max=40
    vus_max........................: 40     min=40            max=40

    NETWORK
    data_received..................: 81 MB  1.4 MB/s
    data_sent......................: 2.6 MB 43 kB/s



running (1m00.2s), 00/40 VUs, 2543 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/40 VUs  1m0s